Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_institutions/european_commission.html.txt.tmx
Source language: en
Languages: ga

source: The European Commission is based in Brussels in Belgium
ga: Tá Coimisiún na hEorpa bunaithe sa Bhruiséal, sa Bheilg

source: It also has offices in Luxembourg, representations in all EU countries and delegations in many capital cities around the world
ga: Tá oifigí ag an gCoimisiún freisin sa Lucsamburg; ionadaíocht i ngach tír den AE agus toscaireachtaí i go leor príomhchathracha ar fud an domhain

source: It is made up of 28 Commissioners, one from each Member State
ga: Tá 28 Coimisinéirí air, ceann ó gach Ballstát

source: The Commission has a number of important functions:
ga: Tá roinnt feidhmeanna tábhachtacha ag an gCoimisiún:

source: • The Commission initiates legislation
ga: • Cuireann an Coimisiún tús le reachtaíocht

source: It makes proposals for European laws, which are sent to the Council and European Parliament for amendment and approval
ga: Déanann sé moltaí do Dhlíthe na hEorpa, a cuirtear chuig an gComhairle agus chuig Parlaimint na hEorpa le leasú agus le ceadú

source: • The Commission acts as a guardian of the EU treaties
ga: • Feidhmníonn an Coimisiún mar choimirceoir conarthaí an AE

source: It ensures that EU legislation is applied by all Member States
ga: Déanann sé cinnte go bhfuil reachtaíocht an AE curtha i bhfeidhm i ngach Ballstát

source: It can institute proceedings against Member States or businesses that fail to comply with EU law
ga: Is féidir leis an dlí a chur ar Bhallstáit nó ar ghnónna nach gcloíann le dlí na hEorpa

source: • The Commission acts as an executive body - it manages policies and the annual budget
ga: • Údarás feidhmiúcháin atá ann - déanann sé bainistiú ar pholasaithe agus ar an mbuiséad bliantúil

source: • The Commission represents the EU on the international stage
ga: • Déanann an Coimisiún ionadaíocht ar son an AE go hidirnáisiúnta

source: It negotiates trade and co-operation agreements with non-EU countries
ga: Tugann sé i gcrích comhaontuithe trádála agus comhoibrithe le tíortha taobh amuigh den AE

source: The President of the Commission is nominated by common agreement of the Governments of the Member States after consultation with the European Parliament
ga: Aontaíonn Rialtais na mBallstát ar dhuine le n-ainmniú mar Uachtarán an Choimisiúin tar éis dul i gcomhairle le Parlaimint na hEorpa

source: Once the President is nominated, the other members of the Commission are selected and agreed
ga: Nuair atá an tUachtarán ainmnithe, déantar baill eile an Choimisiúin a roghnú agus a aontú

source: In practice, the Government of each Member State nominates a Commissioner according to its own selection procedure
ga: I ndáiríre, ainmníonn Rialtas gach Ballstáit Coimisinéir ag brath ar a chóras roghnaithe féin

source: This means that the Commission reflects a variety of talents and vocations such as politicians, lawyers, civil servants and academics
ga: Mar sin bíonn éagsúlacht taithí agus gairmeacha sa Choimisiún, polaiteoirí, dlíodóirí, státseirbhísigh agus daoine acadúla

source: The Parliament must then vote to approve the appointment of the President and the other members of the Commission
ga: Ní mór ansin don Pharlaimint vóta a chaitheamh le ceapachán an Uachtaráin agus baill eile an Choimisiúin a cheadú

source: If the Parliament should refuse to appoint one or more of the Commissioners, the selection process must start again
ga: Dá dtarlódh sé gur dhiúltaigh an Pharlaimint duine nó níos mó de na Coimisinéirí a cheapadh, ní mór don chóras roghnaithe tosú arís

source: Members of the Commission are appointed for a renewable term of 5 years
ga: Déantar baill an Choimisiúin a cheapadh ar feadh tréimhse inathnuaite de 5 bliana

source: The current Commission will be in office from 2014 to 2019
ga: Mairfidh téarma oifige an Choimisiúin ó 2014 go dtí 2019

source: The President of the Commission is appointed for a renewable 5 year term
ga: Déantar Uachtarán an Choimisiúin a cheapadh ar feadh tréimhse inathnuaite de 5 bliana

source: Commissioners are given a portfolio which is his/her area of responsibility
ga: Tugtar dualgais do gach coimisinéir

source: It is up to the President of the Commission to decide which Commissioner will be responsible for each policy area/portfolio and to reshuffle these responsibilities (if necessary) during the Commission's term of office
ga: Is é Uachtarán an Choimisiúin a dhéanann an cinneadh cén cúram a thabharfar do gach Coimisinéir agus más gá atheagrú ar na cúraimí sin i rith téarma oifige an Choimisiúin

source: Commissioners act independently in the interests of the EU
ga: Bíonn Coimisinéirí ag feidhmiú go néamhspléach ar son leasa an AE

source: They do not represent the interests of their own Member State
ga: Ní ar son leasa a mBallstát féin a bhíonn siad ag obair

source: Each Commissioner appoints a cabinet of his/her own choice headed by the chef de cabinet
ga: Ceapann gach Coimisinéir comh-aireacht dá c(h)uid féin le chef de cabinet i gceannas air

source: The cabinet consists of a small group of counsellors (usually about five) who assist him/her in the preparation of Commission decisions
ga: Grúpa beag comhairleoirí atá sa chomh-aireacht (cúigear go hiondúil) a thugann cúnamh don Choimisinéir cinnithe den Choimisiún a ullmhú

source: As well as the cabinets, the Commission's personnel is organised into specialist departments called "Directorates General" which are in turn divided into Directorates and then into Units
ga: Chomh maith leis na comh-aireachtaí tá foireann an Choimisinéara eagraithe i rannóga speisialta ar a dtugtar Príomh Stiúrthóireachtaí agus iad sin roinnte ina Stiúrthóireachtaí agus ansin ina nAonaid

source: At the head of each department, there is a Director General responsible to the relevant Commissioner
ga: Ag ceann gach roinn tá Príomh Stiúrthóir atá freagrach don Choimisinéir Cuí

source: To assist the Commissioners in the performance of their duties, there is a staff of about 23,000 people employed and paid by the Commission
ga: Le cúnamh a chur ar fáil do na Coimisinéirí a ndualgais a chur i gcrích tá foireann oibre timpeall 23,000 fostaithe agus íoctha ag an gCoimisiún

source: This staff comes from all of the Member States and includes language experts, lawyers, experts in particular fields such as agriculture or industry and administrative staff
ga: Is as na Ballstáit ar fad a thagann an fhoireann oibre seo agus ina measc tá saineolaithe teanga, dlíodóirí, saineolaithe i réimsí faoi leith - mar shampla talmhaíocht nó tionscal - agus foireann riaracháin

source: The entire Commission may be forced to resign en masse by the European Parliament
ga: Is féidir le Parlaimint na hEorpa iachall a chur ar an gCoimisiún ina iomlán éirí as oifig

source: Two-thirds of the votes cast and at least half of the MEPs must pass a motion of censure of the Commission
ga: Ní mór do dhá-thrian de na vótaí caite agus ar a laghad ½ de na Feisirí Eorpacha aontú le rún cáinte i dtaobh an Choimisiúin

source: The Commission meets once a week to adopt proposals, finalise policy papers and make decisions. Decisions are taken by a simple majority vote
ga: Bíonn cruinniú uair amháin sa tseachtain ag an gCoimisiún le rúin a mholadh, páipéir pholasaithe a aontú agus le cinnithe a thógáil

source: Once a decision is taken, it becomes Commission policy and has the full support of all Commissioners
ga: Nuair atá cinneadh tógtha, glactar leis mar pholasaí an Choimisiúin agus bíonn lán-tacaíocht na gCoimisinéirí uilig aige

source: The European Commission Representation in Ireland offers a public information centre with information on all aspects of Europe
ga: Cuireann Ionadaíocht an Choimisiúin Eorpaigh lárionad eolais poiblí ar fáil le faisnéis faoi gach gné den Eoraip

source: Further information on the European Commission is available on the Commission's website
ga: Tá tuilleadh eolais ar an gCoimisiún Eorpach le fáil ar shuíomh idirlín an Choimisiúin
